"use client";

import { useState, useRef } from "react";
import { Button } from "@/components/ui/button";
import {
  Dialog,
  DialogTrigger,
  DialogContent,
  DialogHeader,
  DialogTitle,
  DialogDescription,
  DialogFooter,
} from "@/components/ui/dialog";

type Props = {
  onAccept: () => void; // setValue('terms', true) дамжуулна
};

export default function TermsDialog({ onAccept }: Props) {
  const [open, setOpen] = useState(false);
  const [canAccept, setCanAccept] = useState(false);
  const scrollRef = useRef<HTMLDivElement>(null);

  const onScroll = () => {
    const el = scrollRef.current;
    if (!el) return;
    const atBottom = el.scrollTop + el.clientHeight >= el.scrollHeight - 8; // жижиг buffer
    if (atBottom) setCanAccept(true);
  };

  const date = new Date().toISOString();

  return (
    <Dialog open={open} onOpenChange={setOpen}>
      <DialogTrigger asChild>
        <Button variant="link">Үйлчилгээний нөхцөл</Button>
      </DialogTrigger>
      <DialogContent className="max-w-2xl">
        <DialogHeader>
          <DialogTitle className="text-primary">
            Үйлчилгээний нөхцөл
          </DialogTitle>
        </DialogHeader>

        <div
          ref={scrollRef}
          onScroll={onScroll}
          className="h-72 overflow-y-auto rounded-md border p-4 space-y-3 text-sm leading-6 text-gray-700 text-justify"
        >
          <h5 className="font-semibold">
            Үйлчилгээний нөхцөл, нууцлалын бодлого{" "}
          </h5>
          <p>
            ЭНЭХҮҮ ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ НЬ cab21.zakhzeel.mn-ЭЭС ТАНЫ ТОДОРХОЙ
            МЭДЭЭЛЛИЙГ  ХҮЛЭЭН АВАХ, ХАДГАЛАХ, УГ НӨХЦӨЛД ЗААСАН ЗОРИЛГООР
            АШИГЛАХ, УГ НӨХЦЛИЙН ЗААЛТУУДЫГ ХҮЛЭЭН ЗӨВШӨӨРСӨН ЭРХ ЗҮЙН ҮР
            ДАГАВАР БҮХИЙ ХУУЛЬ ЗҮЙН БАРИМТ БИЧИГ ЮМ. ТА ҮҮНИЙГ ЗӨВЛӨЖ
            ҮРГЭЛЖЛҮҮЛЭХ ТОВЧ ДАРСНААР УГ ҮЙЛЧИЛГЭЭНИЙ НӨХЦЛИЙГ ХҮЛЭЭН
            ЗӨВШӨӨРСӨН ГЭЖ ҮЗНЭ.
          </p>
          <p>
            Энэхүү үйлчилгээний нөхцөл нь “Авто Ойл” ХХК-аас хэрэглэгчид санал
            болгож буй cab21.zakhzeel.mn веб хуудсаар дамжуулан хүргэж байгаа
            бүхий л үйлчилгээтэй холбоотой харилцааг шууд болон шууд бусаар
            зохицуулахад зориулагдсан болно.
          </p>
          <p>
            Энэхүү цахим хуудас, захиалгын систем, программ зэрэг хэрэглэгчид
            санал болгож буй бүхий л мэдээлэл үйлчилгээ нь “Авто Ойл” ХХК-ийн
            өмч болно.
          </p>
          <p>
            cab21.zakhzeel.mn-н үйлчилгээ, захиалгын систем дээр байршсан аливаа
            мэдээлэл, программ хангамж, захиалга гэх мэт бүтээгдэхүүн үйлчилгээг
            зөвшөөрөлгүйгээр хуулбарлан худалдах, дамлах зэрэг үйлдэл нь
            хориотой болно.  
          </p>
          <ul>
            Та энэхүү үйлчилгээний нөхцлийг зөвшөөрснөөр cab21.zakhzeel.mn-д
            дараах зөвшөөрөл, эрхийг олгох болно.
            <li>
              1. Таны үүсгэсэн, дамжуулсан хувийн болон санхүүгийн мэдээллийг
              хүлээн авч хадгалах.
            </li>
            <li>
              2. Энэхүү үйлчилгээний нөхцөлд заасан журмын дагуу цуглуулсан
              мэдээллийг cab21.zakhzeel.mn-ээс үзүүлэх үйлчилгээний чанар,
              хүртээмжийг сайжруулах, шинэ бүтээгдэхүүн гаргахтай
              холбоотойгоор cab21.zakhzeel.mn-н дотоод хэрэгцээнд ашиглах.
            </li>
            <li>
              3. Энэхүү үйлчилгээний нөхцөлд заасан журмын дагуу цуглуулсан
              мэдээллийг cab21.zakhzeel.mn аппликейшн болон түүний хиймэл оюун
              ухааныг хөгжүүлэхэд ашиглах.
            </li>
            <li>
              4. cab21.zakhzeel.mn нь хэрэглэгчийн болон харилцагч байгуулагууд
              хувь хүнтэй шууд хийсэн аливаа харилцаанд хариуцлага хүлээхгүй.
            </li>
            <li>
              5. Хэрэглэгч /жолооч/ тус бүр үйлчилгээг cab21.zakhzeel.mn –ээр
              дамжуулан авсан тохиолдолд хариуцлагатай ёс суртахуунтай боловсон
              байдлаар үйлчилгээ авах үүрэгтэй. Ямар нэгэн гомдол гарч ирвэл
              хэрэглэгчийн /жолоочийн/ эрхийг хэтэвчний үлдэгдлийг буцаан
              олгохгүйгээр компани дангаар хасах эрхтэй.
            </li>
            <li>
              6. Хэрэглэгч /жолооч/ нь хувийн болон эд хөрөнгийн аюулгүй байдлыг
              өөрсдөө бүрэн хангах үүрэгтэй.
            </li>
            <li>
              7. cab21.zakhzeel.mn нь таны үүсгэсэн, дамжуулсан хувийн болон
              санхүүгийн мэдээллийг энэхүү үйлчилгээний нөхцөлд зааснаас бусад
              зорилгоор ашиглах, бусдад задруулахгүй байх үүрэгтэй бөгөөд,
              мэдээллийн нууцлалыг хамгаалах үүрэг хүлээнэ.
            </li>
            <li>
              8. Хэрэглэгчийн мэдээллийг хуулийн дагуу эрх бүхий байгууллага
              шаардах, хамтран ажиллахаас бусдаар өөр ямар нэгэн гуравдагч
              этгээдэд задруулахгүй.
            </li>
          </ul>
          <ul>
            Та cab21.zakhzeel.mn-нд хувийн болон санхүүгийн мэдээллээ үүсгэх,
            эсхүл дамжуулахдаа дараах үүрэг хүлээнэ:
            <li>1. Хуурамч мэдээлэл оруулахгүй байх.</li>
            <li>Та хэрэглэгч үүсгэхдээ утасны дугаараар бүртгүүлнэ.</li>
            {/* <li>
              Гар утасны дугаарт шинээр бүртгэл үүсгэсэн код очих ба түүгээр
              нэвтрэнэ.
            </li>
            <li>
              Утасны дугаараар бүртгүүлснээр жолооч болон хэрэглэгч нар
              хоорондоо байршил болон нэгнээ таньж мэдэхэд хэрэглэгдэнэ.
            </li> */}
            <li>
              Утасны дугаар бүртгүүлснээр та үйлчилгээ авч байхдаа ямар нэгэн
              зүйл мартаж буухад жолооч танруу залгаж мэдэгдэхэд хэрэглэгдэнэ.
            </li>
            <li>
              Цахим шуудангаа бүртгүүлснээр ибаримтыг болон аппын талаарх нэмэлт
              мэдээллийг авах боломжтой.
            </li>
            <li>
              Апп хэрэглэж байгаа тохиолдолд байршлын мэдээллийг хуваалцах нь
              жолооч болон хэрэглэгч нар хоорондоо холбоо тогтоох боломжтой.
            </li>
            <li>Бусдын хувийн болон санхүүгийн мэдээллийг оруулахгүй байх.</li>
            <li>
              cab21.zakhzeel.mn-д нэвтрэх нэр, нууц үг болон цахим шуудангийн
              мэдээллээ бусдад дамжуулахгүй байх, үүнтэй холбоотой учирч болох
              аливаа эрсдэлээс сэргийлэх үүрэгтэй. Энэхүү үүргээ биелүүлээгүй
              буюу хангалтгүй биелүүлсэний улмаас учирсан аливаа хохирлыг “Авто
              Ойл” ХХК хариуцахгүй болно.
            </li>
            <li>
              Хэрэв Та энэхүү Үйлчилгээний нөхцлийн 3.a-д заасныг зөрчин хуурамч
              мэдээлэл оруулсан бол cab21.zakhzeel.mn таны хэрэглэгчийн эрхээс
              татгалзах эрхтэй.
            </li>
            <li>
              Хэрэв Та энэхүү Үйлчилгээний нөхцлийн 3.b-д заасныг зөрчин бусдын
              нэр, хувийн болон санхүүгийн мэдээллийг ашигласан, эсхүл
              дамжуулсан бол cab21.zakhzeel.mn таны бүртгэлээс татгалзах эрхтэй
              бөгөөд Та өөрийн хууль бус үйлдлийн улмаас тухайн мэдээллийн
              өмчлөгч, эзэмшигч, cab21.zakhzeel.mn-д учруулсан аливаа гэм хор,
              хохирлыг бүрэн хариуцна.
            </li>
            <li>
              Хэрэглэгч өөрийн хүсэлтээр бүртгэлээ устгах эрхтэй бөгөөд хүсэлт
              өгсөнөөс 7 хоногийн дараа системээс автоматаар бүрэн устгагдана.
            </li>
            <li>
              cab21.zakhzeel.mn-н үйлчилгээг авахдаа та өдөр хоног, тодорхой
              цаг, хаана зэргийг сонгон үйлчилгээний хураамжаа хэтэвчнээсээ
              урьдчилан хийснээр захиалга баталгаажна. Захиалга баталгаажсан
              тохиолдолд цуцлах боломжгүйг анхаарна уу.
            </li>
            <li>
              Дайгдах болох дайх үйлчилгээг цахимаар хялбар хайж цаг алдалгүй
              авах боломжийг бид жолоочийн зарласан үнийн дүнгийн 10% /арван
              хувиар/ тооцон хэтэвчнээс суутгадаг.
            </li>
            <li>
              Захиалга буюу аялал хэрэглэгч болон жолооч талаас баталгаажиж
              үйлчилгээний хураамж төлөгдсөний дараа аль нэг тал захиалгаа
              цуцалсан тохиолдолд цуцалсан талын хураамжийг буцаан олгох
              боломжгүй.
            </li>
            <li>
              Удаа дараа санаатайгаар захиалга баталгаажуулж цуцлаж байгаа
              тохиолдолд цуцалсан талд торгууль ноогдуулна. Давтамжны тооноос
              хамааран үйлчилгээний хураамжийг 2-3 дахин хэтэвчнээс хорогдуулах
              ба 5 болон түүнээс дээш тохиолдолд хэрэглэгчийн эрхийг хаана.
            </li>
            <li>
              cab21.zakhzeel.mn-тэй холбогдох гомдол эсвэл үйлчилгээний талаарх
              санал хүсэлтээ албан ёсоор info@cab21.zakhzeel.mn цахим хаягаар
              илгээх, 8808-9585 утсаар ба ингэхдээ үйлчилгээ авснаас хойш ажлын
              10 хоногт багтаан ирүүлнэ.
            </li>
            <li>
              Дээрх хугацаанд ирүүлээгүй аливаа санал, гомдлыг хүлээн авахгүй ба
              гомдол барагдуулах гэх мэт боломжгүйг анхаарна уу.
            </li>
            <li>
              Ирсэн санал гомдлыг бид ажлын 3 хоногт багтаан
              шийдвэрлэнэ. /Биднээс шалтгаалж байгаа тохиолдолд/.
            </li>
            <li>
              Энэхүү үйлчилгээний нөхцөлд өөрчлөлт оруулж болох бөгөөд энэ
              тохиолдолд уг өөрчлөлтийн талаар “нийтлэгдсэн огноо”- оор
              илэрхийлж мэдэгдэнэ. Уг огноогоос хойш үйлчилгээ авч буй
              тохиолдолж хүлээн зөвшөөрсөнд тооцно.
            </li>
            <li>
              cab21.zakhzeel.mn нь таны мэдээллийн аюулгүй байдлыг хангах,
              cab21.zakhzeel.mn - нийг зүй бусаар, эсхүл хууль бус зорилгоор
              ашиглахаас урьдчилан сэргийлэх зорилгоор вэб сайтанд хандах
              хандалт, таны хийж байгаа аливаа үйлдлийн түүхийн лог болгон
              хадгалах, түүнийг хуулийн хүрээнд ашиглах эрхтэй.
            </li>
            <li>
              Та энэхүү үйлчилгээний нөхцлийг зөвшөөрч, cab21.zakhzeel.mn
              ашигласан нь та энэхүү үйлчилгээний нөхцөлд тусгайлан дурдсанаас
              бусад асуудлаар cab21.zakhzeel.mn-н эсрэг ямарваа нэг шаардлага
              гаргах эрхийг танд олгохгүй болно.
            </li>
            <li>
              Энэхүү үйлчилгээний нөхцөл нь Монгол улсын хуулиар хүлээн
              зөвшөөрөгдсөн цар хүрээ цар хүрээ, хэм хэмжээнд үйлчлэх ба аливаа
              маргааны үед талууд эвийн журмаар шийдвэрлэх бөгөөд тохиролцоонд
              хүрэхгүй тохиолдолд Монгол улсын хуулийн дагуу шийдвэрлэнэ.
            </li>
          </ul>
          <p className="text-center">Улаанбаатар хот {date.slice(0, 10)}</p>
        </div>

        <DialogFooter className="gap-2">
          <Button
            type="button"
            variant="secondary"
            onClick={() => setOpen(false)}
          >
            Хаах
          </Button>
          <Button
            type="button"
            disabled={!canAccept}
            onClick={() => {
              onAccept(); // parent → setValue('terms', true)
              setOpen(false); // close
            }}
          >
            Зөвшөөрөх
          </Button>
        </DialogFooter>
      </DialogContent>
    </Dialog>
  );
}
